Revit 2027 API
InitialLuminousIntensity.Luminosity Property
 The luminosity value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Luminosity { get; set; }
Public Property Luminosity As Double
	Get
	Set
public:
property double Luminosity {
	double get ();
	void set (double value);
}
member Luminosity : float with get, set
Property Value
Double
 The luminosity value in cd as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The luminosity value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace